app/Http/Controllers/ProductController.php

    public function index()
    {
        $products = Product::latest()->paginate(12);
---
select * from `products`