app/Http/Controllers/RawMaterialController.php

select count(*) as aggregate from `raw_materials` where `raw_materials`.`deleted_at` is null
---
    public function index()
    {
        $user = Auth::user();

        if ($user->category === 'systemadmin') {
            $materials = RawMaterial::with('user')->paginate(10);