app/Http/Requests/Auth/LoginRequest.php

select * from `users` where `email` = 'sserwaddah12@gmail.com' limit 1
---
    public function authenticate(): void
{
    $this->ensureIsNotRateLimited();
    $user=User::where('email', $this->email)->first();